## Panda compare to MS Excel

Dataframe -> worksheet
Series ->    Column
Index  ->     Row header
Row    ->    Row
NaN    ->    empty cell

### Dataframe from an array

In [44]:
import pandas as pd
import numpy as np

In [6]:
data = np.array([["Eden", 16],["Oby",18],["Eze",19]])

In [7]:
data

array([['Eden', '16'],
       ['Oby', '18'],
       ['Eze', '19']], dtype='<U11')

In [16]:
df = pd.DataFrame(data, columns=["Name","Age"])

In [17]:
df

   Name Age
0  Eden  16
1   Oby  18
2   Eze  19

In [19]:
df.Name

0    Eden
1     Oby
2     Eze
Name: Name, dtype: object

In [20]:
data1 = np.array([["Apple",4,10],["Kiwi",1,10], ["Banana",2,8],["Orange",2.3,11],["Mango",0.5,6.50]])

In [21]:
data1

array([['Apple', '4', '10'],
       ['Kiwi', '1', '10'],
       ['Banana', '2', '8'],
       ['Orange', '2.3', '11'],
       ['Mango', '0.5', '6.5']], dtype='<U32')

In [22]:
df = pd.DataFrame(data1,columns=["Item","weight in Kg","Cost"])
df

     Item weight in Kg Cost
0   Apple            4   10
1    Kiwi            1   10
2  Banana            2    8
3  Orange          2.3   11
4   Mango          0.5  6.5

### DataFrame from a list

In [23]:
##creating dataframe without numpy but from list
data_holder = [["Apple",4,10],["Grape",1,10], ["Lemon",2,8],["Orange",2.3,11],["Watermelon",0.5,6.50]]
df2 = pd.DataFrame(data_holder,columns=["Fruits","in Kg","Cost"])
df2

       Fruits  in Kg  Cost
0       Apple    4.0  10.0
1       Grape    1.0  10.0
2       Lemon    2.0   8.0
3      Orange    2.3  11.0
4  Watermelon    0.5   6.5

### DataFrame from a Dictionary

In [27]:
##creating dataframe from dictionary data type
States = ["California"
            ,"Texas"
            ,"Florida"
            ,"New York"
            ,"Pennsylvania"
            ,"llinois"]
Population = [39937489
              ,29472295
              ,21992985
              ,19440469
              ,12820878
              ,12659682]

dict_1 = {"states":States, 
          "population":Population}

df3 = pd.DataFrame(dict_1)
df3

         states  population
0    California    39937489
1         Texas    29472295
2       Florida    21992985
3      New York    19440469
4  Pennsylvania    12820878
5       llinois    12659682

In [31]:
import os
os.getcwd()

'C:\\Users\\48502\\Documents\\BI and ETL Training\\Training\\python data analysis\\pythonJupyterDataAnalysis'

In [33]:
pwd

'C:\\Users\\48502\\Documents\\BI and ETL Training\\Training\\python data analysis\\pythonJupyterDataAnalysis'

### DataFrame from a CSV file

In [45]:
df_studentData = pd.read_csv("StudentsPerformanceData.csv")

In [46]:
df_studentData.tail()

    gender;race/ethnicity;parental level of education;lunch;test preparation course;math score;reading score;writing score
995  female;group E;master's degree;standard;comple...
996  male;group C;high school;free/reduced;none;62;...
997  female;group C;high school;free/reduced;comple...
998  female;group D;some college;standard;completed...
999  female;group D;some college;free/reduced;none;...

In [55]:
### Detail documentation about csv loading parameter - https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
dataset = pd.read_csv("DataSample.csv",delimiter=";")

In [56]:
dataset.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75